%输入：img_input 待标记的图片，（x,y） 外接矩形左上角顶点的坐标 （w,h）外接矩形的水平宽度，垂直长度
%输出：img_output 标记后的图片
%
function [img_output]=Img_Tag (img_input,x,y,w,h)
for i=1:375
    for j=1:605
        %**标记中心点*****************************************************************标记外接矩形水平边*************************标记外接矩形垂直边
        if ((i>((x+w/2)-5)) && (i<((x+w/2)+5))) && ((j>(y+h/2)-5)) && (j<((y+h/2)+5))||((i==x)||(i==(x+w))) && ((j>y)&&(j<(y+h)))||((j==y)||(j==(y+h))) && ((i>x)&&(i<(x+w)))
           a(i,j)=1;  %标记为白色
        else
             a(i,j)=0;%非标记区为黑色
        end        
    end   
end
img_output=imadd(img_input,a);%将标记模板与输入图片叠加
end